In [2]:
from numpy import nan as NA

In [3]:
import pandas as pd

In [4]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [5]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [7]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [8]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                    [NA, NA, NA], [NA, 6.5, 3.]])

In [9]:
cleaned = data.dropna()

In [10]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [11]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [12]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [13]:
data[4] = NA

In [14]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [15]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [18]:
import numpy as np
df = pd.DataFrame(np.random.randn(7, 3))

In [19]:
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA

In [20]:
df

          0         1         2
0 -0.311363       NaN       NaN
1  0.781264       NaN       NaN
2  0.331576       NaN  3.632314
3  0.178049       NaN  1.535707
4 -0.997441  1.860286  0.339772
5  1.039692 -0.190591 -0.120037
6  0.856317  1.704230  0.075479

In [21]:
df.dropna()

          0         1         2
4 -0.997441  1.860286  0.339772
5  1.039692 -0.190591 -0.120037
6  0.856317  1.704230  0.075479

In [22]:
df.dropna(thresh=2)

          0         1         2
2  0.331576       NaN  3.632314
3  0.178049       NaN  1.535707
4 -0.997441  1.860286  0.339772
5  1.039692 -0.190591 -0.120037
6  0.856317  1.704230  0.075479

In [23]:
df.fillna(0)

          0         1         2
0 -0.311363  0.000000  0.000000
1  0.781264  0.000000  0.000000
2  0.331576  0.000000  3.632314
3  0.178049  0.000000  1.535707
4 -0.997441  1.860286  0.339772
5  1.039692 -0.190591 -0.120037
6  0.856317  1.704230  0.075479

In [24]:
df.fillna({1: 0.5, 2:0})

          0         1         2
0 -0.311363  0.500000  0.000000
1  0.781264  0.500000  0.000000
2  0.331576  0.500000  3.632314
3  0.178049  0.500000  1.535707
4 -0.997441  1.860286  0.339772
5  1.039692 -0.190591 -0.120037
6  0.856317  1.704230  0.075479

In [25]:
df.fillna(0, inplace=True)

In [26]:
df

          0         1         2
0 -0.311363  0.000000  0.000000
1  0.781264  0.000000  0.000000
2  0.331576  0.000000  3.632314
3  0.178049  0.000000  1.535707
4 -0.997441  1.860286  0.339772
5  1.039692 -0.190591 -0.120037
6  0.856317  1.704230  0.075479

In [27]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0  1.361078  0.389145  1.151144
1  0.377661 -0.625938 -1.834832
2 -0.512002       NaN -0.761334
3 -0.331917       NaN  2.171124
4  0.127735       NaN       NaN
5 -1.402453       NaN       NaN

In [28]:
df.fillna(method='ffill')

          0         1         2
0  1.361078  0.389145  1.151144
1  0.377661 -0.625938 -1.834832
2 -0.512002 -0.625938 -0.761334
3 -0.331917 -0.625938  2.171124
4  0.127735 -0.625938  2.171124
5 -1.402453 -0.625938  2.171124

In [30]:
df.fillna(method='ffill', limit=3)

          0         1         2
0  1.361078  0.389145  1.151144
1  0.377661 -0.625938 -1.834832
2 -0.512002 -0.625938 -0.761334
3 -0.331917 -0.625938  2.171124
4  0.127735 -0.625938  2.171124
5 -1.402453       NaN  2.171124

In [32]:
data = pd.Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [33]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                      'k2': [1, 1, 2, 3, 3, 4, 4]})

In [34]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [35]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [36]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [37]:
data['v1'] = range(7)
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [38]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [39]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
   ....:                               'Pastrami', 'corned beef', 'Bacon',
   ....:                               'pastrami', 'honey ham', 'nova lox'],
   ....:                      'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [40]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [41]:
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}

In [42]:
lowercased = data['food'].str.lower()

In [43]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [44]:
data['amimal'] = lowercased.map(meat_to_animal)

In [46]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object